app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1
---

	<% @user.tasks.each do |t| %>