app/views/projects/index.html.erb


	<% current_user.username.projects.each do |p| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1