app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
---
  def index
    if current_user.nil?
      redirect_to signup_path, :alert => "You need to log in to do that."
    else
      @projects = Project.where(:user_id => current_user.id)