app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    @projects = Project.where(:user_id => current_user.id)
    @categories = Category.where(:user_id => current_user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1